<template>
  <div class="FaqPage">
    <TheFaq :faqs="faqs" :page="'detail'"/>
  </div>
</template>

<script>
export default {
  name: 'FaqPage',
  data() {
    return {
      faqs: [
        {
          id: 1,
          isOpen: false,
          question: 'Где проводится акция, в каких магазинах?',
          answer: 'Акция проходит на территории Российской Федерации, продукт можно приобрести во всех магазинах сети «Магнит Косметик» и гипермаркетах «Магнит».',
        },
        {
          id: 2,
          isOpen: false,
          question: 'Какие сроки проведения акции?',
          answer: 'Период совершения покупки и регистрации чеков: с 00:00:00 03.07.2023 по 23:59:59, 20.08.2023. <br /> Розыгрыш главного приза пройдёт 24.08.2023.',
        },
        {
          id: 3,
          isOpen: false,
          question: 'Какой продукт необходимо купить, чтобы принять участие в акции?',
          answer: 'Со списком продукции Zollider, участвующей в Акции можно ознакомиться в Правилах Акции.',
        },
        {
          id: 4,
          isOpen: false,
          question: 'Где можно зарегистрировать чек?',
          answer: 'Чек можно зарегистрировать на сайте <a href="https://promo.zollider.com/">https://promo.zollider.com/</a> . Пожалуйста, сохраняйте ваши чеки до конца Акции.',
        },
        {
          id: 5,
          isOpen: false,
          question: 'Сколько чеков можно зарегистрировать?',
          answer: 'Вы можете зарегистрировать неограниченное количество чеков, но один и тот же чек не может быть зарегистрирован дважды.',
        },
        {
          id: 6,
          isOpen: false,
          question: 'Кто может принять участие в Акции?',
          answer: 'Работники Организатора и лица, представляющие интересы Организатора, а также члены их семей; лица, признанные в установленном порядке аффилированными с Организатором; работники и представители третьих лиц, имеющих договорные отношения с Организатором, связанные с организацией и/или проведением Акции, а также члены их семей.',
        },
        {
          id: 8,
          isOpen: false,
          question: 'Сколько призов я могу получить?',
          answer: 'Каждый участник, зарегистрировавший чек, может получить не более одного главного приза. <br/> За весь период акции – всего не более двух призов (учитываются главный и поощрительные еженедельные призы).',
        },
        {
          id: 9,
          isOpen: false,
          question: 'Как часто проходят розыгрыши?',
          answer: `Розыгрыш Главных призов проходит единожды по окончании Акции - 24.08.2023. 
            Розыгрыш Поощрительных еженедельных призов проходит: <br/>
            10.07.2023 за этап 03.07.2023-09.07.2023<br/>
            17.07.2023 за этап 10.07.2023-16.07.2023<br/>
            24.07.2023 за этап 17.07.2023-23.07.2023<br/>
            31.07.2023 за этап 24.07.2023-30.07.2023<br/>
            07.08.2023 за этап 31.07.2023-06.08.2023<br/>
            14.08.2023 за этап 07.08.2023-13.08.2023<br/>
            21.08.2023 за этап 14.08.2023-20.08.2023<br/>`,
        },
        {
          id: 10,
          isOpen: false,
          question: 'До какого числа выдаются призы?',
          answer: `Период выдачи Поощрительных призов:<br/>
            11.07.2023-24.09.2023<br/>
            Период выдачи главных призов:<br/>
            25.08.2023-24.09.2023<br/>
            Участник обязуется предоставлять Организатору Акции правдивую, актуальную и достоверную информацию о себе в соответствии с Правилами Акции, а в случае признания Победителем и необходимую информацию для получения Призов на e-mail info@zollider.com не позднее 10 сентября 2023 г. в соответствии с Правилами Акции `,
        },
        {
          id: 11,
          isOpen: false,
          question: 'Как узнать, что стали победителем?',
          answer: 'Участник, ставший Победителем, получает сообщение ВКонтакте, email-сообщение или звонок на номер мобильного телефона с информацией о выигрыше и условиями получения выигранного Приза. ',
        },
        {
          id: 12,
          isOpen: false,
          question: 'Когда и как можно получить приз?',
          answer: `Вручение призов осуществляется:<br/>
            для Поощрительных призов - доставка курьерской службой или транспортной компанией,<br/>
            для Главного приза - путём отправки электронного купона/сертификата на адрес электронной почты победителя, указанной при регистрации.`,
        },
        {
          id: 13,
          isOpen: false,
          question: 'Надо ли платить налоги с приза?',
          answer: 'Согласно законодательству РФ, призы, сумма которых превышает 4 000 рублей, облагаются налогом. При выдаче приза организатор исполняет обязанности налогового агента и исчисляет налог на доходы физических лиц, удерживая его из общей стоимости приза для перечисления в бюджет соответствующего уровня.',
        },
        {
          id: 14,
          isOpen: false,
          question: 'Почему не приняли ваш чек?',
          answer: `Для начала проверьте, что:<br/>
            1.	В чеке присутствует продукция компании Zollider на сумму не менее 1000 рублей (после применения всех скидок, купонов, бонусов по карте Магнит).<br/>
            2.	Дата совершения покупки и регистрации чека на сайте соответствует периоду с 03.07.2023 по 20.08.2023.<br/>
            3.	Чек сфотографирован правильно: видно верхний и нижний край, весь текст чека читабелен.<br/>
            4.	В чеке присутствуют дата и время покупки, итоговая сумма, QR-код, ФН, ФД, ФП/ФПД.<br/>
            <br/>
            Ваш чек может быть отклонён по следующим причинам:<br/>
            -	чек с таким номером и данными уже зарегистрирован в системе;<br/>
            -	информация на чеке нечитаема, потому что чек повреждён, сфотографирован плохо или не полностью;<br/>
            -	чек получен раньше или позднее дат проведения Акции;<br/>
            -	чек не соответствует условиям Акции.<br/>
            Сообщение о статусе отклонения чека сообщается Участнику на e-mail, указанный при регистрации заявки. Если у вас возникли вопросы, можете написать нам на почту info@zollider.com.
            `,
        },
        {
          id: 15,
          isOpen: false,
          question: 'Не получается зарегистрироваться',
          answer: 'Убедитесь, что чек соответствует условиям Акции. Если все условия соблюдены корректно, но у вас всё равно не получается зарегистрировать чек на сайте, напишите нам на почту info@zollider.com.',
        },
        {
          id: 16,
          isOpen: false,
          question: 'Что делать, если возникли вопросы, ответов на которые нет в этом FAQ?',
          answer: 'Пожалуйста, внимательно ознакомьтесь с Правилами Акции и данным разделом FAQ. Если вы так и не нашли ответ на свой вопрос, напишите в службу технической поддержки на почту info@zollider.com.',
        },
        {
          id: 17,
          isOpen: false,
          question: 'Могут ли результаты розыгрышей быть аннулированы?',
          answer: 'Организатор вправе признать недействительными любые действия участников Акции и запретить дальнейшее участие в Акции любому лицу, в отношение которого возникли обоснованные подозрения в том, что он подделывает данные, занимается мошенничеством или обманом, нарушает Правила Акции.',
        },
      ]
    }
  },
  mounted() {
    if (process.client) {
      document.body.classList.add('isFaqPage')
    }
  },
  beforeDestroy() {
    if (process.client) {
      document.body.classList.remove('isFaqPage')
    }
  }
}
</script>

<style lang="scss">
  .FaqPage {
    padding-top: 20rem;
    @include mob {
      padding-top: 10.6rem;
    }
  }
</style>
